package main

import "fmt"

func main() {

	// x := 1

	// for x < 5 {
	// 	fmt.Println(x)
	// 	x++
	// } // 👉 반환값 1 2 3 4
//--------------------------------------------

	for x := 1; x < 5; x++ { // x가 1부터 5까지 1씩 증가

		fmt.Println(x)
	} // 👉 반환값 1 2 3 4

//--------------------------------------------

	for y := 1; y <= 11; y+=2 { // y 가 1부터 11까지 2씩 증가

		fmt.Println(y)
	} // 👉 반환값 1 3 5 7 9 11

//--------------------------------------------

	for z := 1; z <= 15; z++ { // z 가 1부터 15까지 1씩 증가하는데

		if z == 3{  // z 가 3에 도달했을 경우 
			continue  // 계속 진행

		} else if z == 8 { // z 가 8에 도달했을 경우 
			break 		// 반복문 멈춤
		}

		fmt.Println(z)
	} // 👉 반환값 7
	


}
